#+title: Vary Activity

* Kendryte K230
#+PLOT: title:"K230 | Varied Activity, 64+64 Neuron Network, Fan-out 50%"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Activity Percent'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:99]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|----------+--------------+---------------+---------------+-----------|
| N+N Size |         risp |         vrisp |    vrisp-full |           |
|----------+--------------+---------------+---------------+-----------|
|        / |            < |             < |             < |           |
|       1% | 95772.597544 | 135283.215411 | 201507.274413 | 1.4895216 |
|       3% | 52481.867515 | 116822.429907 | 172289.032080 | 1.4747941 |
|       5% | 42382.579065 | 105394.068422 | 161828.009192 | 1.5354565 |
|       7% | 33789.719816 |  95569.402500 | 152933.259925 | 1.6002325 |
|       9% | 30361.729647 |  86267.879018 | 151014.059409 | 1.7505248 |
|      11% | 27216.809101 |  80774.139352 | 142747.023725 | 1.7672367 |
|      13% | 23801.193392 |  74127.885428 | 137189.266312 | 1.8507106 |
|      15% | 21991.893788 |  68545.263865 | 130072.840791 | 1.8976197 |
|      17% | 20034.258582 |  64132.574859 | 129686.547614 | 2.0221634 |
|      19% | 17877.510449 |  60103.016570 | 124700.718276 | 2.0747830 |
|      21% | 15879.619778 |  56634.762417 | 120660.738202 | 2.1305067 |
|      23% | 15746.196506 |  52957.686808 | 115301.686864 | 2.1772418 |
|      25% | 14247.733898 |  50490.770287 | 110031.579063 | 2.1792414 |
|      27% | 13383.190178 |  47701.275532 | 107059.503672 | 2.2443740 |
|      29% | 12656.145191 |  45522.829699 | 106375.057177 | 2.3367409 |
|      31% | 12080.708799 |  43413.329629 | 103065.157793 | 2.3740441 |
|      33% | 11596.623063 |  41419.530137 | 100544.953649 | 2.4274769 |
|      35% | 10529.075516 |  39551.329716 |  98254.025959 | 2.4842155 |
|      37% | 10431.346614 |  37891.274776 |  93427.383566 | 2.4656701 |
|      39% | 10186.037794 |  36324.801848 |  91131.119455 | 2.5087850 |
|      41% |  9190.137512 |  34894.148600 |  91217.572153 | 2.6141223 |
|      43% |  9100.828995 |  33591.540306 |  87250.898684 | 2.5974069 |
|      45% |  9028.497550 |  32246.622166 |  86031.126061 | 2.6679113 |
|      47% |  8030.283806 |  31238.871152 |  83327.778148 | 2.6674388 |
|      49% |  7370.598095 |  30234.955842 |  82451.106494 | 2.7270126 |
|      51% |  7278.910376 |  29352.455480 |  80967.070692 | 2.7584428 |
|      53% |  6621.490445 |  28754.802052 |  80976.905387 | 2.8161176 |
|      55% |  6646.814846 |  27603.187616 |  79255.002972 | 2.8712265 |
|      57% |  6558.972707 |  27021.038581 |  78812.764515 | 2.9167186 |
|      59% |  6445.254971 |  26229.989797 |  78448.600477 | 2.9907980 |
|      61% |  6213.708061 |  25785.357527 |  76564.988362 | 2.9693204 |
|      63% |  6103.459746 |  25132.069023 |  76922.485212 | 3.0607303 |
|      65% |  5911.943960 |  24082.284349 |  75193.058177 | 3.1223391 |
|      67% |  5397.178355 |  23950.833729 |  73489.964945 | 3.0683677 |
|      69% |  5500.017600 |  23171.480542 |  73272.956417 | 3.1622043 |
|      71% |  5425.806438 |  22726.446311 |  71149.563497 | 3.1306946 |
|      73% |  5060.941325 |  22227.013378 |  70315.081882 | 3.1634966 |
|      75% |  5234.873049 |  21492.065130 |  69678.642103 | 3.2420636 |
|      77% |  5009.317330 |  21365.603942 |  68488.928765 | 3.2055695 |
|      79% |  5035.822322 |  20871.641492 |  65880.492786 | 3.1564596 |
|      81% |  4766.351087 |  20439.573467 |  65411.635422 | 3.2002446 |
|      83% |  4625.297696 |  20018.897840 |  61951.727214 | 3.0946622 |
|      85% |  4579.507346 |  19480.342386 |  62853.551226 | 3.2265116 |
|      87% |  4646.660933 |  19067.740053 |  61215.245045 | 3.2104090 |
|      89% |  4504.023670 |  18682.090601 |  60023.649318 | 3.2128979 |
|      91% |  4358.658300 |  18301.711027 |  58872.012245 | 3.2167491 |
|      93% |  4192.186603 |  17933.391796 |  58668.919553 | 3.2714904 |
|      95% |  4272.781187 |  17665.191623 |  56301.551108 | 3.1871464 |
|      97% |  3894.206861 |  17457.064350 |  53898.476829 | 3.0874880 |
|      99% |  3534.204562 |  17052.682557 |  55701.307310 | 3.2664249 |
|----------+--------------+---------------+---------------+-----------|
#+TBLFM: $5=($4/$3)

* MilkV Jupiter
#+PLOT: title:"MilkV Jupiter | Varied Activity, 64+64 Neuron Network, Fan-out 50%"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Activity Percent'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:99]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
| Activity Percent |         risp |         vrisp |    vrisp-full | (vrisp - full) / vrisp |
|               1% | 85022.445926 | 108442.227403 | 147288.420184 |              1.3582202 |
|               3% | 55346.775220 |  98896.317101 | 133035.334185 |              1.3452001 |
|               5% | 43280.487858 |  91672.472590 | 125705.522244 |              1.3712461 |
|               7% | 35625.349574 |  85211.537642 | 120007.680492 |              1.4083501 |
|               9% | 31408.120255 |  80301.290442 | 115849.349506 |              1.4426835 |
|              11% | 27750.797835 |  75511.020833 | 110442.321498 |              1.4625987 |
|              13% | 24694.528680 |  71541.504804 | 106865.008122 |              1.4937484 |
|              15% | 22612.872151 |  67832.941033 | 102989.793711 |              1.5182858 |
|              17% | 20961.152696 |  63926.765497 |  96704.316881 |              1.5127360 |
|              19% | 19467.221093 |  60653.480600 |  95389.810460 |              1.5727013 |
|              21% | 18425.469896 |  58314.138263 |  92974.822418 |              1.5943787 |
|              23% | 17033.859907 |  55225.430206 |  88414.984572 |              1.6009832 |
|              25% | 15639.613264 |  53259.196532 |  86524.650873 |              1.6245955 |
|              27% | 14678.360427 |  51107.760713 |  84989.928693 |              1.6629554 |
|              29% | 13948.168605 |  49026.336948 |  82604.349945 |              1.6848974 |
|              31% | 13295.131987 |  46861.014916 |  79201.647394 |              1.6901394 |
|              33% | 12828.045186 |  45512.884698 |  77949.613370 |              1.7126933 |
|              35% | 12157.345225 |  43983.303938 |  74181.775022 |              1.6865894 |
|              37% | 11738.094931 |  42484.854149 |  73409.042526 |              1.7278874 |
|              39% | 11279.348866 |  40716.943949 |  72322.268026 |              1.7762204 |
|              41% | 10947.195110 |  39457.693461 |  70098.207589 |              1.7765409 |
|              43% | 10579.514041 |  38357.677673 |  69033.122092 |              1.7997211 |
|              45% | 10057.984279 |  37474.096031 |  66708.025643 |              1.7801103 |
|              47% |  9632.454436 |  36370.513697 |  66128.381640 |              1.8181866 |
|              49% |  8985.533291 |  35182.774514 |  64239.691136 |              1.8258847 |
|              51% |  8610.409124 |  34429.570870 |  63299.953158 |              1.8385345 |
|              53% |  8168.646610 |  33277.648734 |  61831.065164 |              1.8580359 |
|              55% |  7715.585019 |  32435.518190 |  60123.252668 |              1.8536239 |
|              57% |  7746.005385 |  31721.661454 |  59690.801647 |              1.8817048 |
|              59% |  7495.386590 |  30919.069336 |  57670.792051 |              1.8652176 |
|              61% |  7326.554805 |  30162.454983 |  57364.776880 |              1.9018603 |
|              63% |  7040.567751 |  29526.832509 |  55570.065517 |              1.8820192 |
|              65% |  6638.307816 |  28794.379337 |  55137.430044 |              1.9148678 |
|              67% |  6703.936082 |  28391.426925 |  53847.686434 |              1.8966178 |
|              69% |  6497.725796 |  27630.949980 |  52910.612811 |              1.9149039 |
|              71% |  6377.388332 |  27058.839446 |  52925.454497 |              1.9559396 |
|              73% |  6239.731741 |  26508.604693 |  51947.782089 |              1.9596574 |
|              75% |  5987.654654 |  25953.869592 |  51152.988358 |              1.9709195 |
|              77% |  5886.948224 |  25649.509710 |  50138.633321 |              1.9547599 |
|              79% |  5776.867343 |  25008.127641 |  49304.802288 |              1.9715511 |
|              81% |  5552.621920 |  24526.214845 |  49041.243686 |              1.9995439 |
|              83% |  5547.277784 |  24110.386996 |  48122.963797 |              1.9959432 |
|              85% |  5387.791695 |  23671.160242 |  47076.768086 |              1.9887816 |
|              87% |  5336.429886 |  23363.339649 |  46211.147977 |              1.9779342 |
|              89% |  5222.507545 |  22975.829427 |  45682.125498 |              1.9882688 |
|              91% |  5102.886958 |  22448.099993 |  45661.474957 |              2.0340909 |
|              93% |  5000.925171 |  22049.598367 |  45153.046250 |              2.0477945 |
|              95% |  4915.572583 |  21829.962060 |  44037.149740 |              2.0172802 |
|              97% |  4460.138184 |  21479.646961 |  43568.238754 |              2.0283499 |
|              99% |  4488.348472 |  21118.075383 |  42894.706364 |              2.0311845 |
#+TBLFM: $5=($4/$3)

* Desktop Intel i5-12400F
#+PLOT: title:"Desktop | Varied Activity, Network 64+64, 32 Synapse Fan-out"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Activity Percent'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:99]"
#+PLOT: labels:("x" "risp" "superneuro" "vrisp")

|------------------+---------------+----------------+------------+------------------|
| Activity Percent |          risp |          vrisp | superneuro | vrisp/superneuro |
|------------------+---------------+----------------+------------+------------------|
|                / |             < |              < |          < |                < |
|               1% | 974373.964728 | 1227144.434900 |  17.918403 |        68485.145 |
|               3% | 489524.182495 | 1027432.446317 |  18.159125 |        56579.403 |
|               5% | 493875.938364 | 1018226.249873 |  17.925226 |        56804.096 |
|               7% | 424178.154825 |  971722.864639 |  18.315882 |        53053.567 |
|               9% | 402495.471926 |  758207.597240 |  18.198370 |        41663.489 |
|              11% | 344234.079174 |  847816.871556 |  17.840070 |        47523.181 |
|              13% | 307087.581378 |  742666.171556 |  17.643490 |        42092.929 |
|              15% | 272672.738180 |  633191.920471 |  18.128939 |        34927.136 |
|              17% | 291919.663709 |  357692.170118 |  18.234780 |        19615.930 |
|              19% | 248034.327951 |  637226.789014 |  18.389497 |        34651.670 |
|              21% | 247255.464346 |  543862.511557 |  18.208546 |        29868.530 |
|              23% | 187687.687688 |  554661.933552 |  17.919712 |        30952.614 |
|              25% | 224804.981678 |  435824.798431 |  16.917271 |        25762.122 |
|              27% | 192178.341501 |  500625.782228 |  17.929862 |        27921.341 |
|              29% | 202388.180530 |  428706.164795 |  18.315442 |        23406.815 |
|              31% | 186018.825105 |  336620.998418 |  18.189721 |        18506.111 |
|              33% | 136733.438162 |  429424.142225 |  18.124567 |        23692.932 |
|              35% | 175527.900160 |  359298.649037 |  18.305922 |        19627.454 |
|              37% | 171588.393761 |  382877.708860 |  18.130678 |        21117.672 |
|              39% | 161707.632600 |  322976.551902 |  18.208744 |        17737.443 |
|              41% | 147972.773010 |  328062.463093 |  18.080970 |        18144.074 |
|              43% | 148878.202742 |  304330.624791 |  18.072859 |        16839.097 |
|              45% | 153043.265331 |  290132.590594 |  18.320154 |        15836.799 |
|              47% | 138780.948151 |  275398.639531 |  18.318714 |        15033.732 |
|              49% | 141683.196373 |  262418.978140 |  18.347321 |        14302.850 |
|              51% | 129631.069975 |  251004.016064 |  18.243687 |        13758.404 |
|              53% | 122699.386503 |  279368.626903 |  18.252270 |        15305.966 |
|              55% | 126415.857605 |  257692.109468 |  18.413838 |        13994.481 |
|              57% | 124094.112975 |  261383.240107 |  18.303868 |        14280.219 |
|              59% | 110224.416913 |  267809.319764 |  18.070570 |        14820.192 |
|              61% |  89039.266316 |  260274.329143 |  18.125954 |        14359.207 |
|              63% | 107943.567103 |  260878.639257 |  18.354427 |        14213.391 |
|              65% | 107136.352436 |  257281.053823 |  18.418714 |        13968.459 |
|              67% | 108150.198996 |  244075.077494 |  18.375599 |        13282.564 |
|              69% | 106537.117532 |  259289.029481 |  18.048618 |        14366.143 |
|              71% | 103178.943241 |  262818.996557 |  18.178904 |        14457.362 |
|              73% | 103287.645765 |  242571.255306 |  18.352467 |        13217.365 |
|              75% | 100584.395337 |  237079.184448 |  18.393077 |        12889.588 |
|              77% |  96127.041498 |  236456.929370 |  18.243537 |        12961.134 |
|              79% |  97712.549223 |  219293.436547 |  18.088276 |        12123.512 |
|              81% |  85571.015386 |  216136.771349 |  17.981039 |        12020.260 |
|              83% |  94715.805226 |  222350.691511 |  18.066351 |        12307.449 |
|              85% |  88968.763067 |  204156.628966 |  18.128852 |        11261.421 |
|              87% |  85845.015409 |  220288.578037 |  18.324132 |        12021.774 |
|              89% |  87802.479542 |  206953.642384 |  18.213346 |        11362.747 |
|              91% |  87971.637944 |  202085.522593 |  18.167054 |        11123.737 |
|              93% |  86649.105781 |  196463.654224 |  18.269641 |        10753.559 |
|              95% |  84836.350680 |  197655.802186 |  18.322395 |        10787.662 |
|              97% |  85931.323686 |  193311.424705 |  18.319306 |        10552.333 |
|              99% |  85578.338411 |  205803.663305 |  18.150254 |        11338.886 |
|------------------+---------------+----------------+------------+------------------|
#+TBLFM: $5=($3/$4)
